example_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.2" jmeter="3.2-ETN3 r20170815">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1502811979000</longProp>
        <longProp name="ThreadGroup.end_time">1502811979000</longProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="jp@gc - Dummy Sampler" enabled="true">
          <boolProp name="WAITING">false</boolProp>
          <boolProp name="SUCCESFULL">true</boolProp>
          <stringProp name="RESPONSE_CODE">200</stringProp>
          <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
          <stringProp name="REQUEST_DATA">Dummy Sampler used to simulate requests and responses
without actual network activity. This helps debugging tests.</stringProp>
          <stringProp name="RESPONSE_DATA">&lt;CATALOG&gt;
&lt;CD&gt;
&lt;TITLE&gt;Empire Burlesque&lt;/TITLE&gt;
&lt;ARTIST&gt;Bob Dylan&lt;/ARTIST&gt;
&lt;COUNTRY&gt;USA&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Columbia&lt;/COMPANY&gt;
&lt;PRICE&gt;10.90&lt;/PRICE&gt;
&lt;YEAR&gt;1985&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Hide your heart&lt;/TITLE&gt;
&lt;ARTIST&gt;Bonnie Tyler&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;CBS Records&lt;/COMPANY&gt;
&lt;PRICE&gt;9.90&lt;/PRICE&gt;
&lt;YEAR&gt;1988&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Greatest Hits&lt;/TITLE&gt;
&lt;ARTIST&gt;Dolly Parton&lt;/ARTIST&gt;
&lt;COUNTRY&gt;USA&lt;/COUNTRY&gt;
&lt;COMPANY&gt;RCA&lt;/COMPANY&gt;
&lt;PRICE&gt;9.90&lt;/PRICE&gt;
&lt;YEAR&gt;1982&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Still got the blues&lt;/TITLE&gt;
&lt;ARTIST&gt;Gary Moore&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Virgin records&lt;/COMPANY&gt;
&lt;PRICE&gt;10.20&lt;/PRICE&gt;
&lt;YEAR&gt;1990&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Eros&lt;/TITLE&gt;
&lt;ARTIST&gt;Eros Ramazzotti&lt;/ARTIST&gt;
&lt;COUNTRY&gt;EU&lt;/COUNTRY&gt;
&lt;COMPANY&gt;BMG&lt;/COMPANY&gt;
&lt;PRICE&gt;9.90&lt;/PRICE&gt;
&lt;YEAR&gt;1997&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;One night only&lt;/TITLE&gt;
&lt;ARTIST&gt;Bee Gees&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Polydor&lt;/COMPANY&gt;
&lt;PRICE&gt;10.90&lt;/PRICE&gt;
&lt;YEAR&gt;1998&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Sylvias Mother&lt;/TITLE&gt;
&lt;ARTIST&gt;Dr.Hook&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;CBS&lt;/COMPANY&gt;
&lt;PRICE&gt;8.10&lt;/PRICE&gt;
&lt;YEAR&gt;1973&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Maggie May&lt;/TITLE&gt;
&lt;ARTIST&gt;Rod Stewart&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Pickwick&lt;/COMPANY&gt;
&lt;PRICE&gt;8.50&lt;/PRICE&gt;
&lt;YEAR&gt;1990&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Romanza&lt;/TITLE&gt;
&lt;ARTIST&gt;Andrea Bocelli&lt;/ARTIST&gt;
&lt;COUNTRY&gt;EU&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Polydor&lt;/COMPANY&gt;
&lt;PRICE&gt;10.80&lt;/PRICE&gt;
&lt;YEAR&gt;1996&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;When a man loves a woman&lt;/TITLE&gt;
&lt;ARTIST&gt;Percy Sledge&lt;/ARTIST&gt;
&lt;COUNTRY&gt;USA&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Atlantic&lt;/COMPANY&gt;
&lt;PRICE&gt;8.70&lt;/PRICE&gt;
&lt;YEAR&gt;1987&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Black angel&lt;/TITLE&gt;
&lt;ARTIST&gt;Savage Rose&lt;/ARTIST&gt;
&lt;COUNTRY&gt;EU&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Mega&lt;/COMPANY&gt;
&lt;PRICE&gt;10.90&lt;/PRICE&gt;
&lt;YEAR&gt;1995&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;1999 Grammy Nominees&lt;/TITLE&gt;
&lt;ARTIST&gt;Many&lt;/ARTIST&gt;
&lt;COUNTRY&gt;USA&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Grammy&lt;/COMPANY&gt;
&lt;PRICE&gt;10.20&lt;/PRICE&gt;
&lt;YEAR&gt;1999&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;For the good times&lt;/TITLE&gt;
&lt;ARTIST&gt;Kenny Rogers&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Mucik Master&lt;/COMPANY&gt;
&lt;PRICE&gt;8.70&lt;/PRICE&gt;
&lt;YEAR&gt;1995&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Big Willie style&lt;/TITLE&gt;
&lt;ARTIST&gt;Will Smith&lt;/ARTIST&gt;
&lt;COUNTRY&gt;USA&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Columbia&lt;/COMPANY&gt;
&lt;PRICE&gt;9.90&lt;/PRICE&gt;
&lt;YEAR&gt;1997&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Tupelo Honey&lt;/TITLE&gt;
&lt;ARTIST&gt;Van Morrison&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Polydor&lt;/COMPANY&gt;
&lt;PRICE&gt;8.20&lt;/PRICE&gt;
&lt;YEAR&gt;1971&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Soulsville&lt;/TITLE&gt;
&lt;ARTIST&gt;Jorn Hoel&lt;/ARTIST&gt;
&lt;COUNTRY&gt;Norway&lt;/COUNTRY&gt;
&lt;COMPANY&gt;WEA&lt;/COMPANY&gt;
&lt;PRICE&gt;7.90&lt;/PRICE&gt;
&lt;YEAR&gt;1996&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;The very best of&lt;/TITLE&gt;
&lt;ARTIST&gt;Cat Stevens&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Island&lt;/COMPANY&gt;
&lt;PRICE&gt;8.90&lt;/PRICE&gt;
&lt;YEAR&gt;1990&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Stop&lt;/TITLE&gt;
&lt;ARTIST&gt;Sam Brown&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;A and M&lt;/COMPANY&gt;
&lt;PRICE&gt;8.90&lt;/PRICE&gt;
&lt;YEAR&gt;1988&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Bridge of Spies&lt;/TITLE&gt;
&lt;ARTIST&gt;T&apos;Pau&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Siren&lt;/COMPANY&gt;
&lt;PRICE&gt;7.90&lt;/PRICE&gt;
&lt;YEAR&gt;1987&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Private Dancer&lt;/TITLE&gt;
&lt;ARTIST&gt;Tina Turner&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Capitol&lt;/COMPANY&gt;
&lt;PRICE&gt;8.90&lt;/PRICE&gt;
&lt;YEAR&gt;1983&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Midt om natten&lt;/TITLE&gt;
&lt;ARTIST&gt;Kim Larsen&lt;/ARTIST&gt;
&lt;COUNTRY&gt;EU&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Medley&lt;/COMPANY&gt;
&lt;PRICE&gt;7.80&lt;/PRICE&gt;
&lt;YEAR&gt;1983&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Pavarotti Gala Concert&lt;/TITLE&gt;
&lt;ARTIST&gt;Luciano Pavarotti&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;DECCA&lt;/COMPANY&gt;
&lt;PRICE&gt;9.90&lt;/PRICE&gt;
&lt;YEAR&gt;1991&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;The dock of the bay&lt;/TITLE&gt;
&lt;ARTIST&gt;Otis Redding&lt;/ARTIST&gt;
&lt;COUNTRY&gt;USA&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Stax Records&lt;/COMPANY&gt;
&lt;PRICE&gt;7.90&lt;/PRICE&gt;
&lt;YEAR&gt;1968&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Picture book&lt;/TITLE&gt;
&lt;ARTIST&gt;Simply Red&lt;/ARTIST&gt;
&lt;COUNTRY&gt;EU&lt;/COUNTRY&gt;
&lt;COMPANY&gt;Elektra&lt;/COMPANY&gt;
&lt;PRICE&gt;7.20&lt;/PRICE&gt;
&lt;YEAR&gt;1985&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Red&lt;/TITLE&gt;
&lt;ARTIST&gt;The Communards&lt;/ARTIST&gt;
&lt;COUNTRY&gt;UK&lt;/COUNTRY&gt;
&lt;COMPANY&gt;London&lt;/COMPANY&gt;
&lt;PRICE&gt;7.80&lt;/PRICE&gt;
&lt;YEAR&gt;1987&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;CD&gt;
&lt;TITLE&gt;Unchain my heart&lt;/TITLE&gt;
&lt;ARTIST&gt;Joe Cocker&lt;/ARTIST&gt;
&lt;COUNTRY&gt;USA&lt;/COUNTRY&gt;
&lt;COMPANY&gt;EMI&lt;/COMPANY&gt;
&lt;PRICE&gt;8.20&lt;/PRICE&gt;
&lt;YEAR&gt;1987&lt;/YEAR&gt;
&lt;/CD&gt;
&lt;/CATALOG&gt;</stringProp>
          <stringProp name="RESPONSE_TIME">0</stringProp>
          <stringProp name="LATENCY">0</stringProp>
          <stringProp name="CONNECT">0</stringProp>
        </kg.apc.jmeter.samplers.DummySampler>
        <hashTree>
          <HtmlExtractor guiclass="HtmlExtractorGui" testclass="HtmlExtractor" testname="CSS/JQuery Extractor" enabled="true">
            <stringProp name="HtmlExtractor.refname">my_title_jquery</stringProp>
            <stringProp name="HtmlExtractor.expr">TITLE</stringProp>
            <stringProp name="HtmlExtractor.default">JQUERY_NOT_FOUND</stringProp>
            <boolProp name="HtmlExtractor.default_empty_value">false</boolProp>
            <stringProp name="HtmlExtractor.match_number">1</stringProp>
            <stringProp name="TestPlan.comments">$(xml).find(&quot;TITLE&quot;).text()</stringProp>
          </HtmlExtractor>
          <hashTree/>
          <XPathExtractor guiclass="XPathExtractorGui" testclass="XPathExtractor" testname="XPath Extractor" enabled="true">
            <stringProp name="XPathExtractor.refname">my_title_xpath</stringProp>
            <stringProp name="XPathExtractor.matchNumber">1</stringProp>
            <stringProp name="XPathExtractor.xpathQuery">//CATALOG/CD/TITLE</stringProp>
            <boolProp name="XPathExtractor.validate">false</boolProp>
            <boolProp name="XPathExtractor.tolerant">false</boolProp>
            <boolProp name="XPathExtractor.namespace">false</boolProp>
          </XPathExtractor>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Regular Expression Extractor" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">my_title_regular</stringProp>
            <stringProp name="RegexExtractor.regex">\&lt;TITLE\&gt;(.*)\&lt;\/TITLE\&gt;</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.match_number">1</stringProp>
          </RegexExtractor>
          <hashTree/>
          <cz.etnetera.jmeter.extractor.BoundaryExtractor guiclass="cz.etnetera.jmeter.extractor.gui.BoundaryExtractorGui" testclass="cz.etnetera.jmeter.extractor.BoundaryExtractor" testname="et@sm - Boundary Body Extractor" enabled="true">
            <stringProp name="BoundaryExtractor.ref_name">my_title_boundary</stringProp>
            <stringProp name="BoundaryExtractor.lb">&lt;TITLE&gt;</stringProp>
            <stringProp name="BoundaryExtractor.rb">&lt;/TITLE&gt;</stringProp>
            <stringProp name="BoundaryExtractor.default">f!</stringProp>
            <stringProp name="BoundaryExtractor.use_field">body</stringProp>
            <stringProp name="BoundaryExtractor.occurrence">FIRST</stringProp>
            <stringProp name="BoundaryExtractor.match_number">1</stringProp>
          </cz.etnetera.jmeter.extractor.BoundaryExtractor>
          <hashTree/>
        </hashTree>
        <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="jp@gc - Dummy Sampler" enabled="true">
          <boolProp name="WAITING">false</boolProp>
          <boolProp name="SUCCESFULL">true</boolProp>
          <stringProp name="RESPONSE_CODE">200</stringProp>
          <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
          <stringProp name="REQUEST_DATA">Dummy Sampler used to simulate requests and responses
without actual network activity. This helps debugging tests.</stringProp>
          <stringProp name="RESPONSE_DATA">{
  &quot;CATALOG&quot;: {
    &quot;CD&quot;: [
      {
        &quot;TITLE&quot;: &quot;Empire Burlesque&quot;,
        &quot;ARTIST&quot;: &quot;Bob Dylan&quot;,
        &quot;COUNTRY&quot;: &quot;USA&quot;,
        &quot;COMPANY&quot;: &quot;Columbia&quot;,
        &quot;PRICE&quot;: &quot;10.90&quot;,
        &quot;YEAR&quot;: &quot;1985&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Hide your heart&quot;,
        &quot;ARTIST&quot;: &quot;Bonnie Tyler&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;CBS Records&quot;,
        &quot;PRICE&quot;: &quot;9.90&quot;,
        &quot;YEAR&quot;: &quot;1988&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Greatest Hits&quot;,
        &quot;ARTIST&quot;: &quot;Dolly Parton&quot;,
        &quot;COUNTRY&quot;: &quot;USA&quot;,
        &quot;COMPANY&quot;: &quot;RCA&quot;,
        &quot;PRICE&quot;: &quot;9.90&quot;,
        &quot;YEAR&quot;: &quot;1982&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Still got the blues&quot;,
        &quot;ARTIST&quot;: &quot;Gary Moore&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Virgin records&quot;,
        &quot;PRICE&quot;: &quot;10.20&quot;,
        &quot;YEAR&quot;: &quot;1990&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Eros&quot;,
        &quot;ARTIST&quot;: &quot;Eros Ramazzotti&quot;,
        &quot;COUNTRY&quot;: &quot;EU&quot;,
        &quot;COMPANY&quot;: &quot;BMG&quot;,
        &quot;PRICE&quot;: &quot;9.90&quot;,
        &quot;YEAR&quot;: &quot;1997&quot;
      },
      {
        &quot;TITLE&quot;: &quot;One night only&quot;,
        &quot;ARTIST&quot;: &quot;Bee Gees&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Polydor&quot;,
        &quot;PRICE&quot;: &quot;10.90&quot;,
        &quot;YEAR&quot;: &quot;1998&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Sylvias Mother&quot;,
        &quot;ARTIST&quot;: &quot;Dr.Hook&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;CBS&quot;,
        &quot;PRICE&quot;: &quot;8.10&quot;,
        &quot;YEAR&quot;: &quot;1973&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Maggie May&quot;,
        &quot;ARTIST&quot;: &quot;Rod Stewart&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Pickwick&quot;,
        &quot;PRICE&quot;: &quot;8.50&quot;,
        &quot;YEAR&quot;: &quot;1990&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Romanza&quot;,
        &quot;ARTIST&quot;: &quot;Andrea Bocelli&quot;,
        &quot;COUNTRY&quot;: &quot;EU&quot;,
        &quot;COMPANY&quot;: &quot;Polydor&quot;,
        &quot;PRICE&quot;: &quot;10.80&quot;,
        &quot;YEAR&quot;: &quot;1996&quot;
      },
      {
        &quot;TITLE&quot;: &quot;When a man loves a woman&quot;,
        &quot;ARTIST&quot;: &quot;Percy Sledge&quot;,
        &quot;COUNTRY&quot;: &quot;USA&quot;,
        &quot;COMPANY&quot;: &quot;Atlantic&quot;,
        &quot;PRICE&quot;: &quot;8.70&quot;,
        &quot;YEAR&quot;: &quot;1987&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Black angel&quot;,
        &quot;ARTIST&quot;: &quot;Savage Rose&quot;,
        &quot;COUNTRY&quot;: &quot;EU&quot;,
        &quot;COMPANY&quot;: &quot;Mega&quot;,
        &quot;PRICE&quot;: &quot;10.90&quot;,
        &quot;YEAR&quot;: &quot;1995&quot;
      },
      {
        &quot;TITLE&quot;: &quot;1999 Grammy Nominees&quot;,
        &quot;ARTIST&quot;: &quot;Many&quot;,
        &quot;COUNTRY&quot;: &quot;USA&quot;,
        &quot;COMPANY&quot;: &quot;Grammy&quot;,
        &quot;PRICE&quot;: &quot;10.20&quot;,
        &quot;YEAR&quot;: &quot;1999&quot;
      },
      {
        &quot;TITLE&quot;: &quot;For the good times&quot;,
        &quot;ARTIST&quot;: &quot;Kenny Rogers&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Mucik Master&quot;,
        &quot;PRICE&quot;: &quot;8.70&quot;,
        &quot;YEAR&quot;: &quot;1995&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Big Willie style&quot;,
        &quot;ARTIST&quot;: &quot;Will Smith&quot;,
        &quot;COUNTRY&quot;: &quot;USA&quot;,
        &quot;COMPANY&quot;: &quot;Columbia&quot;,
        &quot;PRICE&quot;: &quot;9.90&quot;,
        &quot;YEAR&quot;: &quot;1997&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Tupelo Honey&quot;,
        &quot;ARTIST&quot;: &quot;Van Morrison&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Polydor&quot;,
        &quot;PRICE&quot;: &quot;8.20&quot;,
        &quot;YEAR&quot;: &quot;1971&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Soulsville&quot;,
        &quot;ARTIST&quot;: &quot;Jorn Hoel&quot;,
        &quot;COUNTRY&quot;: &quot;Norway&quot;,
        &quot;COMPANY&quot;: &quot;WEA&quot;,
        &quot;PRICE&quot;: &quot;7.90&quot;,
        &quot;YEAR&quot;: &quot;1996&quot;
      },
      {
        &quot;TITLE&quot;: &quot;The very best of&quot;,
        &quot;ARTIST&quot;: &quot;Cat Stevens&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Island&quot;,
        &quot;PRICE&quot;: &quot;8.90&quot;,
        &quot;YEAR&quot;: &quot;1990&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Stop&quot;,
        &quot;ARTIST&quot;: &quot;Sam Brown&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;A and M&quot;,
        &quot;PRICE&quot;: &quot;8.90&quot;,
        &quot;YEAR&quot;: &quot;1988&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Bridge of Spies&quot;,
        &quot;ARTIST&quot;: &quot;T&apos;Pau&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Siren&quot;,
        &quot;PRICE&quot;: &quot;7.90&quot;,
        &quot;YEAR&quot;: &quot;1987&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Private Dancer&quot;,
        &quot;ARTIST&quot;: &quot;Tina Turner&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;Capitol&quot;,
        &quot;PRICE&quot;: &quot;8.90&quot;,
        &quot;YEAR&quot;: &quot;1983&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Midt om natten&quot;,
        &quot;ARTIST&quot;: &quot;Kim Larsen&quot;,
        &quot;COUNTRY&quot;: &quot;EU&quot;,
        &quot;COMPANY&quot;: &quot;Medley&quot;,
        &quot;PRICE&quot;: &quot;7.80&quot;,
        &quot;YEAR&quot;: &quot;1983&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Pavarotti Gala Concert&quot;,
        &quot;ARTIST&quot;: &quot;Luciano Pavarotti&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;DECCA&quot;,
        &quot;PRICE&quot;: &quot;9.90&quot;,
        &quot;YEAR&quot;: &quot;1991&quot;
      },
      {
        &quot;TITLE&quot;: &quot;The dock of the bay&quot;,
        &quot;ARTIST&quot;: &quot;Otis Redding&quot;,
        &quot;COUNTRY&quot;: &quot;USA&quot;,
        &quot;COMPANY&quot;: &quot;Stax Records&quot;,
        &quot;PRICE&quot;: &quot;7.90&quot;,
        &quot;YEAR&quot;: &quot;1968&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Picture book&quot;,
        &quot;ARTIST&quot;: &quot;Simply Red&quot;,
        &quot;COUNTRY&quot;: &quot;EU&quot;,
        &quot;COMPANY&quot;: &quot;Elektra&quot;,
        &quot;PRICE&quot;: &quot;7.20&quot;,
        &quot;YEAR&quot;: &quot;1985&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Red&quot;,
        &quot;ARTIST&quot;: &quot;The Communards&quot;,
        &quot;COUNTRY&quot;: &quot;UK&quot;,
        &quot;COMPANY&quot;: &quot;London&quot;,
        &quot;PRICE&quot;: &quot;7.80&quot;,
        &quot;YEAR&quot;: &quot;1987&quot;
      },
      {
        &quot;TITLE&quot;: &quot;Unchain my heart&quot;,
        &quot;ARTIST&quot;: &quot;Joe Cocker&quot;,
        &quot;COUNTRY&quot;: &quot;USA&quot;,
        &quot;COMPANY&quot;: &quot;EMI&quot;,
        &quot;PRICE&quot;: &quot;8.20&quot;,
        &quot;YEAR&quot;: &quot;1987&quot;
      }
    ]
  }
}</stringProp>
          <stringProp name="RESPONSE_TIME">0</stringProp>
          <stringProp name="LATENCY">0</stringProp>
          <stringProp name="CONNECT">0</stringProp>
        </kg.apc.jmeter.samplers.DummySampler>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">my_title_json</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.CATALOG.CD[0].TITLE</stringProp>
            <stringProp name="JSONPostProcessor.match_numbers">1</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <com.atlantbh.jmeter.plugins.jsonutils.jsonpathextractor.JSONPathExtractor guiclass="com.atlantbh.jmeter.plugins.jsonutils.jsonpathextractor.gui.JSONPathExtractorGui" testclass="com.atlantbh.jmeter.plugins.jsonutils.jsonpathextractor.JSONPathExtractor" testname="jp@gc - JSON Path Extractor" enabled="true">
            <stringProp name="VAR">my_title_json_path</stringProp>
            <stringProp name="JSONPATH">$.CATALOG.CD[0].TITLE</stringProp>
            <stringProp name="SUBJECT">BODY</stringProp>
          </com.atlantbh.jmeter.plugins.jsonutils.jsonpathextractor.JSONPathExtractor>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
    <WorkBench guiclass="WorkBenchGui" testclass="WorkBench" testname="WorkBench" enabled="true">
      <boolProp name="WorkBench.save">true</boolProp>
    </WorkBench>
    <hashTree/>
  </hashTree>
</jmeterTestPlan>